In [1]:
import pandas as pd
import numpy as np

In [2]:
# ## 1. create the following two dimensional arrays

# [[1., 0., 0., 0., 0.],
#        [0., 1., 0., 0., 0.],
#        [0., 0., 1., 0., 0.],
#        [0., 0., 0., 1., 0.],
#        [0., 0., 0., 0., 1.]]
# 2. [[1, 0, 0, 0],
#        [0, 2, 0, 0],
#        [0, 0, 3, 0],
#        [0, 0, 0, 4]]
# 3. Create a checkerboard pattern in an array using row and col slicing

Question 1.1: Create an array with below pattern
    
        [[1., 0., 0., 0., 0.],
    
        [0., 1., 0., 0., 0.],

        [0., 0., 1., 0., 0.],

        [0., 0., 0., 1., 0.],

        [0., 0., 0., 0., 1.]]

In [3]:
arr1=np.zeros([5,5])
array_shape = arr1.shape
rows = array_shape[0]
cols = array_shape[1]
for r in range(0,rows):
    for c in range(0,cols):
        if(r==c):
            arr1[r,c] = 1
arr1

array([[1., 0., 0., 0., 0.],
       [0., 1., 0., 0., 0.],
       [0., 0., 1., 0., 0.],
       [0., 0., 0., 1., 0.],
       [0., 0., 0., 0., 1.]])

Question 1.2: Create an array with below pattern
    
        [[1, 0, 0, 0],
          
        [0, 2, 0, 0],
        
        [0, 0, 3, 0],
        
        [0, 0, 0, 4]]

In [4]:
arr2=np.full([4,4],0)
array_shape = arr1.shape
rows = array_shape[0]
cols = array_shape[1]
for r in range(0,rows-1):
    for c in range(0,cols-1):
        if(r==c):
            arr2[r,c] = r+1
arr2

array([[1, 0, 0, 0],
       [0, 2, 0, 0],
       [0, 0, 3, 0],
       [0, 0, 0, 4]])

Question 1.3: 3. Create a checkerboard pattern in an array using row and col slicing

In [5]:
arr3=np.full([4,4],1)
array_shape = arr1.shape
rows = array_shape[0]
cols = array_shape[1]
pos_value=0
for r in range(0,rows-1):
    if(pos_value==0):
            pos_value=1
    elif(pos_value==1):
            pos_value=0
    for c in range(0,cols-1):     
        if(pos_value==0):
            pos_value=1
        elif(pos_value==1):
            pos_value=0
        arr3[r,c] = pos_value
arr3[:3,0:3]

array([[0, 1, 0],
       [1, 0, 1],
       [0, 1, 0]])

4. Compute the no of bytes occupied in the memory for an array of numbers from 1 to 10

In [6]:
import sys
arr4=np.arange(1,10)
sys.getsizeof(arr4)

184

### 5. img=[[200,210,209],[213,0,214],[214,215,217]]


Given a snap shot of the image, estimate the centre pixel with mean,median values.

To be checked on this problem ???

In [7]:
# yet to be completed
img=[[200,210,209],[213,0,214],[214,215,217]]
img

[[200, 210, 209], [213, 0, 214], [214, 215, 217]]

6. create a Pandas series to store the marks of students and filter the marks >50,>70,>90

In [8]:
arr6 = np.random.randint(0,100, size =(20))
ser6 = pd.Series(arr6)
print("Marks greater than 50:\n", ser6[ser6>50])
print("\n\nMarks greater than 50:\n", ser6[ser6>70])
print("\n\nMarks greater than 50:\n", ser6[ser6>90])

Marks greater than 50:
 0     93
4     70
6     78
7     73
8     68
10    60
18    51
19    67
dtype: int64


Marks greater than 50:
 0    93
6    78
7    73
dtype: int64


Marks greater than 50:
 0    93
dtype: int64

7.Create data frame given below to store student info from the numpy arrays defined

In [9]:
name=np.array(['kevin','john','hari'])
age=np.array([23,21,22])
gender=np.array(['m','m','f'])
state=np.array(['TN','KL','KN'])
cgpa=np.array([9,8,7])

df=pd.DataFrame({'name':name,'age':age,'gender':gender,'state':state,'cgpa':cgpa})
df

    name  age gender state  cgpa
0  kevin   23      m    TN     9
1   john   21      m    KL     8
2   hari   22      f    KN     7

    1.Filter the age
    
    2.filter age,cgpa
    
    3.Filter age>22
    
    4.names starts with j
    
    5.names contains 'n'

In [10]:
df_age=df[df['age']>22]
df_age

    name  age gender state  cgpa
0  kevin   23      m    TN     9

In [11]:
## **********Yet to be completed.************

print(df)
df_filtered = pd.DataFrame()
for row in range(len(df)):
     if df.loc[row,'name'][0]=='j':
            df_temp = pd.DataFrame(df.loc[row])
            print(df_temp)
            pd.concat([df_filtered,df_temp])
df_filtered   
# df_name_j=df[df['name'][1]=='j']
# df_name_j

    name  age gender state  cgpa
0  kevin   23      m    TN     9
1   john   21      m    KL     8
2   hari   22      f    KN     7
           1
name    john
age       21
gender     m
state     KL
cgpa       8

Empty DataFrame
Columns: []
Index: []

8. Given the two data frames,

dfr1=pd.DataFrame({'Id':[1,2,3,5,9],

                    'Col1':[1,2,3,4,5],
                    
                     'col2':[6,7,8,9,10],
                     
                      'col4':['apple','orange','banana','strawberry','rasberry']})
                      
  dfr2=pd.DataFrame({'Id':[1,1,3,5],
  
                    'ColA':[8,9,10,11],
                    
                     'colB':[12,13,15,17],
                     
                      'col4':['apple','orange','banana','kiwi']})
                      

Perform left, right and inner join on the dataframes

In [12]:
dfr1=pd.DataFrame({'Id':[1,2,3,5,9],
                'Col1':[1,2,3,4,5],
                
                 'col2':[6,7,8,9,10],
                 
                  'col4':['apple','orange','banana','strawberry','rasberry']})
                  
dfr2=pd.DataFrame({'Id':[1,1,3,5],
                'ColA':[8,9,10,11],
                
                 'colB':[12,13,15,17],
                 
                  'col4':['apple','orange','banana','kiwi']})

In [13]:
dfr1

   Id  Col1  col2        col4
0   1     1     6       apple
1   2     2     7      orange
2   3     3     8      banana
3   5     4     9  strawberry
4   9     5    10    rasberry

In [14]:
dfr2

   Id  ColA  colB    col4
0   1     8    12   apple
1   1     9    13  orange
2   3    10    15  banana
3   5    11    17    kiwi

In [15]:
dfr1.join(dfr2, how='left', lsuffix="_L", rsuffix="_R")

   Id_L  Col1  col2      col4_L  Id_R  ColA  colB  col4_R
0     1     1     6       apple   1.0   8.0  12.0   apple
1     2     2     7      orange   1.0   9.0  13.0  orange
2     3     3     8      banana   3.0  10.0  15.0  banana
3     5     4     9  strawberry   5.0  11.0  17.0    kiwi
4     9     5    10    rasberry   NaN   NaN   NaN     NaN

In [16]:
dfr1.join(dfr2, how='right', lsuffix="_L", rsuffix="_R")

   Id_L  Col1  col2      col4_L  Id_R  ColA  colB  col4_R
0     1     1     6       apple     1     8    12   apple
1     2     2     7      orange     1     9    13  orange
2     3     3     8      banana     3    10    15  banana
3     5     4     9  strawberry     5    11    17    kiwi

In [17]:
dfr1.join(dfr2, how='inner', lsuffix="_L", rsuffix="_R")

   Id_L  Col1  col2      col4_L  Id_R  ColA  colB  col4_R
0     1     1     6       apple     1     8    12   apple
1     2     2     7      orange     1     9    13  orange
2     3     3     8      banana     3    10    15  banana
3     5     4     9  strawberry     5    11    17    kiwi

9. Apply sigmoid function to the array [2,5,6]
1.define sigmoid function
2.create the np array
3.Apply the function to the array

In [42]:
def sigmoid_function(x):
    return(1/(1+np.exp(-x)))

In [58]:
sigmoid_function(2.0)

0.8807970779778823

In [59]:
arr9=np.array([2,5,6])
arr9

array([2, 5, 6])

In [60]:
arr9

array([2, 5, 6])

In [61]:
for i in range(len(arr9)):
    temp= sigmoid_function(arr9[i])
    print(temp)
    arr9[i]=temp
arr9

0.8807970779778823
0.9933071490757153
0.9975273768433653

array([0, 0, 0])